andeyqi/LPC845BRK/lpc845breakout_hello_world/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOCON_PIO_CLKDIV0 0x00u      /*!<@brief IOCONCLKDIV0 */
#define IOCON_PIO_HYS_EN 0x20u       /*!<@brief Enable hysteresis */
#define IOCON_PIO_INV_DI 0x00u       /*!<@brief Input not invert */
#define IOCON_PIO_MODE_INACT 0x00u   /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP 0x10u  /*!<@brief Selects pull-up function */
#define IOCON_PIO_OD_DI 0x00u        /*!<@brief Disables Open-drain function */
#define IOCON_PIO_SMODE_BYPASS 0x00u /*!<@brief Bypass input filter */

/*! @name PIO0_24 (number 20), CN1[10]/PIO0_24
  @{ */
#define BOARD_DEBUG_UART_RX_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_DEBUG_UART_RX_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO0_25 (number 19), CN1[11]/PIO0_25
  @{ */
#define BOARD_DEBUG_UART_TX_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_DEBUG_UART_TX_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name CAPT_X0 (number 9), S1/PIO0_31/CAPT_X0
  @{ */
#define BOARD_CAPX_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_CAPX_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_CAPX_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name CAPT_YL (number 1), S1/PIO1_8/CAPT_YL
  @{ */
#define BOARD_CAPY_LOW_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_CAPY_LOW_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_CAPY_LOW_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name CAPT_YH (number 3), S1/PIO1_9/CAPT_YH
  @{ */
#define BOARD_CAPY_HIGH_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_CAPY_HIGH_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_CAPY_HIGH_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
